conf t
Router(config)#int gi0/0
Router(config-if)#no shut
Router(config-if)#ip add 172.17.5.88 255.255.255.0
Router(config-if)#end
Router#show arp
Protocol  Address          Age (min)  Hardware Addr   Type   Interface
Internet  172.17.5.88             -   0cc1.bd91.9f00  ARPA   GigabitEthernet0/0


Router(config)#int gi0/1
Router(config-if)#ip add 172.17.5.254 255.255.255.0
Router(config-if)#no shut
Router(config-if)#end
Router#show arp
Protocol  Address          Age (min)  Hardware Addr   Type   Interface
Internet  10.1.1.1                -   0cc1.bd91.9f00  ARPA   GigabitEthernet0/0
Internet  172.17.5.254            -   0cc1.bd91.9f01  ARPA   GigabitEthernet0/1
show process
debug ip icmp
dir all




Router(config)#int gi0/0
Router(config-if)#ip address 10.1.1.1 255.255.255.0
Router(config-if)#int gi0/1
Router(config-if)#ip address 10.2.2.2 255.255.255.0
Router(config-if)#no shut
Router(config-if)#int gi0/2
Router(config-if)#no shut
Router(config-if)#ip address 10.2.2.2 255.255.255.0
Router(config-if)#ip address 10.3.3.3 255.255.255.0
Router(config-if)#no shut
Router(config-if)#int gi0/4
Router(config-if)#int gi0/4
Router(config-if)#no shut
Router(config-if)#ip address 10.4.4.4 255.255.255.0
Router(config-if)#no shut

Router#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0         10.1.1.1        YES manual up                    up
GigabitEthernet0/1         10.2.2.2        YES manual up                    up
GigabitEthernet0/2         10.3.3.3        YES manual up                    up
GigabitEthernet0/3         unassigned      YES NVRAM  administratively down down
GigabitEthernet0/4         10.4.4.4        YES manual down                  down
GigabitEthernet0/5         unassigned      YES unset  administratively down down
GigabitEthernet0/6         unassigned      YES unset  administratively down down
GigabitEthernet0/7         unassigned      YES unset  administratively down down
Router#show interfaces g0/0

Router#show arp
Protocol  Address          Age (min)  Hardware Addr   Type   Interface
Internet  10.1.1.1                -   0cc1.bd91.9f00  ARPA   GigabitEthernet0/0
Internet  10.2.2.2                -   0cc1.bd91.9f01  ARPA   GigabitEthernet0/1
Internet  10.3.3.3                -   0cc1.bd91.9f02  ARPA   GigabitEthernet0/2
Internet  10.4.4.4                -   0cc1.bd91.9f04  ARPA   GigabitEthernet0/4

############################
#more computer are pinging:
Router#show arp
Protocol  Address          Age (min)  Hardware Addr   Type   Interface
Internet  10.1.1.1                -   0cc1.bd91.9f00  ARPA   GigabitEthernet0/0
Internet  10.2.2.2                -   0cc1.bd91.9f01  ARPA   GigabitEthernet0/1
Internet  10.3.3.2                4   c292.4677.387f  ARPA   GigabitEthernet0/2
Internet  10.3.3.3                -   0cc1.bd91.9f02  ARPA   GigabitEthernet0/2
Internet  10.3.3.5                0   72be.cb99.6ccc  ARPA   GigabitEthernet0/2
Internet  10.4.4.4                -   0cc1.bd91.9f04  ARPA   GigabitEthernet0/4
Router#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR

Gateway of last resort is not set

      10.0.0.0/8 is variably subnetted, 6 subnets, 2 masks
C        10.1.1.0/24 is directly connected, GigabitEthernet0/0
L        10.1.1.1/32 is directly connected, GigabitEthernet0/0
C        10.2.2.0/24 is directly connected, GigabitEthernet0/1
L        10.2.2.2/32 is directly connected, GigabitEthernet0/1
C        10.3.3.0/24 is directly connected, GigabitEthernet0/2
L        10.3.3.3/32 is directly connected, GigabitEthernet0/2
Router#



Router#       copy run flsh
Destination filename [flsh]? backup-1
3669 bytes copied in 8.593 secs (427 bytes/sec)
Router#dir flash
%Error opening flash0:/flash (File not found)
Router#dir flash:
Directory of flash0:/

    1  drw-           0  Jan 30 2013 00:00:00 +00:00  boot
  264  drw-           0  Oct 14 2013 00:00:00 +00:00  config
  267  -rw-   143178592  Mar 22 2016 00:00:00 +00:00  vios-adventerprisek9-m
  268  -rw-      524288  Apr 12 2020 03:07:16 +00:00  nvram
  269  -rw-         159  Apr 12 2020 13:58:38 +00:00  e1000_bia.txt
  272  -rw-        3669  Apr 12 2020 14:56:04 +00:00  backup-1

2142715904 bytes total (1994399744 bytes free)


Router#sh ip int br
Interface                  IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0         10.1.1.1        YES manual up                    up
GigabitEthernet0/1         10.2.2.2        YES manual up                    up
GigabitEthernet0/2         10.3.3.3        YES manual up                    up
GigabitEthernet0/3         unassigned      YES NVRAM  administratively down down
GigabitEthernet0/4         10.4.4.4        YES manual down                  down
GigabitEthernet0/5         unassigned      YES unset  administratively down down
GigabitEthernet0/6         unassigned      YES unset  administratively down down
GigabitEthernet0/7         unassigned      YES unset  administratively down down















------
ip dns 192.168.10.1

show ip




router:
ip dhcp pool DHCPOOLLIAN
network 192.168.10.0 .255.255.255.0
default-router 192.168.0.1
dns-server 192.168.10.1
exit

ip dhcp excude-address  192.168.10.1
end

ping 192.168.10.10




four  host
fourt ports
four colision domains
one broadcast domain



c2691
c3725
c3745